app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("doctor_id", "location", "created_at", "updated_at", "time") VALUES (?, ?, ?, ?, ?)  [["doctor_id", 3], ["location", "Atlanta"], ["created_at", "2020-09-23 21:01:58.369116"], ["updated_at", "2020-09-23 21:01:58.369116"], ["time", "2021-09-23 21:01:00"]]
---
  def create
    @appointment = Appointment.new(appointment_params)
	  @appointment.save

UPDATE "appointments" SET "time" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["time", "2020-09-16 19:54:57"], ["updated_at", "2020-09-17 14:26:05.934353"], ["id", 2]]
---
  def update
    @appointment.update(appointment_params)

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_appointments
    @appointment = Appointment.find(params[:id])