app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_appointments
    @appointment = Appointment.find(params[:id])