app/controllers/appointments_controller.rb

  def set_appointments
    @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]