app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_doctors
    @doctor = Doctor.find(params[:id])