app/controllers/doctors_controller.rb

  def create
    @doctor = Doctor.new(doctor_params)

    if @doctor.valid?
      @doctor.save
---
INSERT INTO "doctors" ("name", "practice_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Dr. Robotnik"], ["practice_type", "Destroy Sonic the Hedgehog"], ["created_at", "2020-09-20 21:44:23.488532"], ["updated_at", "2020-09-20 21:44:23.488532"]]

  def update
    @doctor.update(doctor_params)
---
UPDATE "doctors" SET "practice_type" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["practice_type", "Obtain all Chaos Emeralds"], ["updated_at", "2020-09-20 22:02:03.694567"], ["id", 4]]

  def destroy
    @doctor.destroy
---
DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 1]]

  def set_doctors
    @doctor = Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]