app/views/appointments/_form.html.erb

SELECT "doctors".* FROM "doctors"
---
  <%= f.label :doctor, "Appointment Doctor:" %>
  <%= f.collection_select :doctor_id, Doctor.all, :id, :name %><br>